QuickRecon/DiveCANHead/atpack/avrasm/inc/AVR64EA28def.inc
; Clock Select
.equ TCB_CLKSEL_DIV1_gc = (0x00<<1)      ; CLK_PER
.equ TCB_CLKSEL_DIV2_gc = (0x01<<1)      ; CLK_PER/2
.equ TCB_CLKSEL_TCA0_gc = (0x02<<1)      ; Use CLK_TCA from TCA0
.equ TCB_CLKSEL_TCA1_gc = (0x03<<1)      ; Use CLK_TCA from TCA1
.equ TCB_CLKSEL_EVENT_gc = (0x07<<1)     ; Count on event edge

; Timer Mode select
.equ TCB_CNTMODE_INT_gc = (0x00<<0)      ; Periodic Interrupt
.equ TCB_CNTMODE_TIMEOUT_gc = (0x01<<0)  ; Periodic Timeout
.equ TCB_CNTMODE_CAPT_gc = (0x02<<0)     ; Input Capture Event
.equ TCB_CNTMODE_FRQ_gc = (0x03<<0)      ; Input Capture Frequency measurement
.equ TCB_CNTMODE_PW_gc = (0x04<<0)       ; Input Capture Pulse-Width measurement
.equ TCB_CNTMODE_FRQPW_gc = (0x05<<0)    ; Input Capture Frequency and Pulse-Width measurement
.equ TCB_CNTMODE_SINGLE_gc = (0x06<<0)   ; Single Shot
.equ TCB_CNTMODE_PWM8_gc = (0x07<<0)     ; 8-bit PWM


;*************************************************************************
;** TWI - Two-Wire Interface
;*************************************************************************

; TWI_CTRLA masks
.equ TWI_FMEN_bm = 0x01                  ; Fast-mode Enable bit mask
.equ TWI_FMEN_bp = 0                     ; Fast-mode Enable bit position
.equ TWI_FMPEN_bm = 0x02                 ; Fast-mode Plus Enable bit mask
.equ TWI_FMPEN_bp = 1                    ; Fast-mode Plus Enable bit position
.equ TWI_SDAHOLD_gm = 0x0C               ; SDA Hold Time group mask
.equ TWI_SDAHOLD_gp = 2                  ; SDA Hold Time group position
.equ TWI_SDAHOLD_0_bm = (1<<2)           ; SDA Hold Time bit 0 mask
.equ TWI_SDAHOLD_0_bp = 2                ; SDA Hold Time bit 0 position
.equ TWI_SDAHOLD_1_bm = (1<<3)           ; SDA Hold Time bit 1 mask
.equ TWI_SDAHOLD_1_bp = 3                ; SDA Hold Time bit 1 position
.equ TWI_SDASETUP_bm = 0x10              ; SDA Setup Time bit mask
.equ TWI_SDASETUP_bp = 4                 ; SDA Setup Time bit position
.equ TWI_INPUTLVL_bm = 0x40              ; Input voltage transition level bit mask
.equ TWI_INPUTLVL_bp = 6                 ; Input voltage transition level bit position

; TWI_DUALCTRL masks
.equ TWI_ENABLE_bm = 0x01                ; Enable bit mask
.equ TWI_ENABLE_bp = 0                   ; Enable bit position
; Masks for TWI_FMPEN already defined
; Masks for TWI_SDAHOLD already defined
; Masks for TWI_INPUTLVL already defined

; TWI_DBGCTRL masks
.equ TWI_DBGRUN_bm = 0x01                ; Debug Run bit mask
.equ TWI_DBGRUN_bp = 0                   ; Debug Run bit position

; TWI_MCTRLA masks
; Masks for TWI_ENABLE already defined
.equ TWI_SMEN_bm = 0x02                  ; Smart Mode Enable bit mask
.equ TWI_SMEN_bp = 1                     ; Smart Mode Enable bit position
.equ TWI_TIMEOUT_gm = 0x0C               ; Inactive Bus Time-Out group mask
.equ TWI_TIMEOUT_gp = 2                  ; Inactive Bus Time-Out group position
.equ TWI_TIMEOUT_0_bm = (1<<2)           ; Inactive Bus Time-Out bit 0 mask
.equ TWI_TIMEOUT_0_bp = 2                ; Inactive Bus Time-Out bit 0 position
.equ TWI_TIMEOUT_1_bm = (1<<3)           ; Inactive Bus Time-Out bit 1 mask
.equ TWI_TIMEOUT_1_bp = 3                ; Inactive Bus Time-Out bit 1 position
.equ TWI_QCEN_bm = 0x10                  ; Quick Command Enable bit mask
.equ TWI_QCEN_bp = 4                     ; Quick Command Enable bit position
.equ TWI_WIEN_bm = 0x40                  ; Write Interrupt Enable bit mask
.equ TWI_WIEN_bp = 6                     ; Write Interrupt Enable bit position
.equ TWI_RIEN_bm = 0x80                  ; Read Interrupt Enable bit mask
.equ TWI_RIEN_bp = 7                     ; Read Interrupt Enable bit position

; TWI_MCTRLB masks
.equ TWI_MCMD_gm = 0x03                  ; Command group mask
.equ TWI_MCMD_gp = 0                     ; Command group position
.equ TWI_MCMD_0_bm = (1<<0)              ; Command bit 0 mask
.equ TWI_MCMD_0_bp = 0                   ; Command bit 0 position
.equ TWI_MCMD_1_bm = (1<<1)              ; Command bit 1 mask
.equ TWI_MCMD_1_bp = 1                   ; Command bit 1 position
.equ TWI_ACKACT_bm = 0x04                ; Acknowledge Action bit mask
.equ TWI_ACKACT_bp = 2                   ; Acknowledge Action bit position
.equ TWI_FLUSH_bm = 0x08                 ; Flush bit mask
.equ TWI_FLUSH_bp = 3                    ; Flush bit position

; TWI_MSTATUS masks
.equ TWI_BUSSTATE_gm = 0x03              ; Bus State group mask
.equ TWI_BUSSTATE_gp = 0                 ; Bus State group position
.equ TWI_BUSSTATE_0_bm = (1<<0)          ; Bus State bit 0 mask
.equ TWI_BUSSTATE_0_bp = 0               ; Bus State bit 0 position
.equ TWI_BUSSTATE_1_bm = (1<<1)          ; Bus State bit 1 mask
.equ TWI_BUSSTATE_1_bp = 1               ; Bus State bit 1 position
.equ TWI_BUSERR_bm = 0x04                ; Bus Error bit mask
.equ TWI_BUSERR_bp = 2                   ; Bus Error bit position
.equ TWI_ARBLOST_bm = 0x08               ; Arbitration Lost bit mask
.equ TWI_ARBLOST_bp = 3                  ; Arbitration Lost bit position
.equ TWI_RXACK_bm = 0x10                 ; Received Acknowledge bit mask
.equ TWI_RXACK_bp = 4                    ; Received Acknowledge bit position
.equ TWI_CLKHOLD_bm = 0x20               ; Clock Hold bit mask
.equ TWI_CLKHOLD_bp = 5                  ; Clock Hold bit position
.equ TWI_WIF_bm = 0x40                   ; Write Interrupt Flag bit mask
.equ TWI_WIF_bp = 6                      ; Write Interrupt Flag bit position
.equ TWI_RIF_bm = 0x80                   ; Read Interrupt Flag bit mask
.equ TWI_RIF_bp = 7                      ; Read Interrupt Flag bit position

; TWI_MBAUD masks
.equ TWI_BAUD_gm = 0xFF                  ; Baud Rate group mask
.equ TWI_BAUD_gp = 0                     ; Baud Rate group position
.equ TWI_BAUD_0_bm = (1<<0)              ; Baud Rate bit 0 mask
.equ TWI_BAUD_0_bp = 0                   ; Baud Rate bit 0 position
.equ TWI_BAUD_1_bm = (1<<1)              ; Baud Rate bit 1 mask
.equ TWI_BAUD_1_bp = 1                   ; Baud Rate bit 1 position
.equ TWI_BAUD_2_bm = (1<<2)              ; Baud Rate bit 2 mask
.equ TWI_BAUD_2_bp = 2                   ; Baud Rate bit 2 position
.equ TWI_BAUD_3_bm = (1<<3)              ; Baud Rate bit 3 mask
.equ TWI_BAUD_3_bp = 3                   ; Baud Rate bit 3 position
.equ TWI_BAUD_4_bm = (1<<4)              ; Baud Rate bit 4 mask
.equ TWI_BAUD_4_bp = 4                   ; Baud Rate bit 4 position
.equ TWI_BAUD_5_bm = (1<<5)              ; Baud Rate bit 5 mask
.equ TWI_BAUD_5_bp = 5                   ; Baud Rate bit 5 position
.equ TWI_BAUD_6_bm = (1<<6)              ; Baud Rate bit 6 mask
.equ TWI_BAUD_6_bp = 6                   ; Baud Rate bit 6 position
.equ TWI_BAUD_7_bm = (1<<7)              ; Baud Rate bit 7 mask
.equ TWI_BAUD_7_bp = 7                   ; Baud Rate bit 7 position

